zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_uart_ex.h
/** @defgroup UARTEx_Autonomous_Trigger_Polarity UARTEx Autonomous Trigger Polarity
  * @brief    UART Trigger polarity edge selection
  * @{
  */
#define UART_TRIG_POLARITY_RISING   0x00000000U           /*!< UART triggered on rising edge  */
#define UART_TRIG_POLARITY_FALLING  USART_AUTOCR_TRIGPOL  /*!< UART triggered on falling edge */
/**
  * @}
  */

/** @defgroup UARTEx_Autonomous_IDLE_FRAME UARTEx Autonomous IDLE Frame
  * @brief    UART IDLE frame transmission
  * @{
  */
#define UART_IDLE_FRAME_ENABLE      0x00000000U          /*!< IDLE Frame sent after enabling the transmitter */
#define UART_IDLE_FRAME_DISABLE     USART_AUTOCR_IDLEDIS /*!< IDLE Frame not sent after enabling the transmitter */
/**
  * @}
  */

/* no trigger for uarts. only lpuart have triggers on MP25 and MP23 */

#if defined(STM32MP21xxxx)

/** @defgroup UARTEx_Autonomous_Trigger_selection UARTEx Autonomous trigger selection
  * @brief    UART Autonomous Trigger selection
  * @{
  */
#define UART_EXTI2_LINE4_TRG       4U   /*!< UART EXTI2 line 4 Internal Trigger     */
#define UART_EXTI2_LINE5_TRG       5U   /*!< UART EXTI2 line 5 Internal Trigger     */
/*!< No Trigger index 6 on UART            */
#define UART_LPTIM3_CH1_TRG        7U   /*!< UART LPTIM3 channel 1 Internal Trigger */
#define UART_LPTIM4_CH1_TRG        8U   /*!< UART LPTIM4 channel 1 Internal Trigger */
#define UART_LPTIM5_OUT_TRG        9U   /*!< UART LPTIM5 out Internal Trigger       */
#define UART_RTC_ALRA_TRG          10U  /*!< UART RTC alarm Internal Trigger        */
#define UART_RTC_WUT_TRG           11U  /*!< UART RTC wakeup Internal Trigger       */
#define UART_EXTI1_LINE6_TRG       12U  /*!< UART EXTI1 line 6 Internal Trigger     */
#define UART_EXTI1_LINE7_TRG       13U  /*!< UART EXTI1 line 7 Internal Trigger     */
#define UART_LPTIM1_CH1_TRG        14U  /*!< UART LPTIM1 channel 1 Internal Trigger */
#define UART_LPTIM2_CH1_TRG        15U  /*!< UART LPTIM2 channel 1 Internal Trigger */
/**
  * @}
  */

#endif /* STM32MP21xxxx */

/** @defgroup LPUARTEx_Autonomous_Trigger_selection LPUARTEx Autonomous trigger selection
  * @brief    LPUART Autonomous Trigger selection
  * @{
  */
#define LPUART_LPDMA_CH0_TCF_TRG    0U   /*!< LPUART LPDMA channel0 Internal Trigger  */
#define LPUART_LPDMA_CH1_TCF_TRG    1U   /*!< LPUART LPDMA channel1 Internal Trigger  */
#define LPUART_LPDMA_CH2_TCF_TRG    2U   /*!< LPUART LPDMA channel2 Internal Trigger  */
#define LPUART_LPDMA_CH3_TCF_TRG    3U   /*!< LPUART LPDMA channel3 Internal Trigger  */
#define LPUART_EXTI2_LINE4_TRG      4U   /*!< LPUART EXTI2 line 4 Internal Trigger    */
#define LPUART_EXTI2_LINE5_TRG      5U   /*!< LPUART EXTI2 line 5 Internal Trigger    */
/*!< No Trigger index 6 on LPUART            */
#define LPUART_LPTIM3_CH1_TRG       7U   /*!< LPUART LPTIM3 channel 1 Internal Trigger*/
#define LPUART_LPTIM4_CH1_TRG       8U   /*!< LPUART LPTIM4 channel 2 Internal Trigger*/
#define LPUART_LPTIM5_OUT_TRG       9U   /*!< LPUART LPTIM5 out Internal Trigger      */
#define LPUART_RTC_ALRA_TRG         10U  /*!< LPUART RTC alarm Internal Trigger       */
#define LPUART_RTC_WUT_TRG          11U  /*!< LPUART RTC wakeup Internal Trigger      */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/** @addtogroup UARTEx_Exported_Functions
  * @{
  */

/** @addtogroup UARTEx_Exported_Functions_Group1
  * @{
  */

/* Initialization and de-initialization functions  ****************************/
HAL_StatusTypeDef HAL_RS485Ex_Init(UART_HandleTypeDef *huart, uint32_t Polarity, uint32_t AssertionTime,
                                   uint32_t DeassertionTime);

/**
  * @}
  */

/** @addtogroup UARTEx_Exported_Functions_Group2
  * @{
  */

void HAL_UARTEx_WakeupCallback(UART_HandleTypeDef *huart);

void HAL_UARTEx_RxFifoFullCallback(UART_HandleTypeDef *huart);
void HAL_UARTEx_TxFifoEmptyCallback(UART_HandleTypeDef *huart);

/**
  * @}
  */

/** @addtogroup UARTEx_Exported_Functions_Group3
  * @{
  */

/* Peripheral Control functions  **********************************************/
HAL_StatusTypeDef HAL_UARTEx_StopModeWakeUpSourceConfig(UART_HandleTypeDef *huart, UART_WakeUpTypeDef WakeUpSelection);
HAL_StatusTypeDef HAL_UARTEx_EnableStopMode(UART_HandleTypeDef *huart);
HAL_StatusTypeDef HAL_UARTEx_DisableStopMode(UART_HandleTypeDef *huart);

HAL_StatusTypeDef HAL_MultiProcessorEx_AddressLength_Set(UART_HandleTypeDef *huart, uint32_t AddressLength);

HAL_StatusTypeDef HAL_UARTEx_EnableFifoMode(UART_HandleTypeDef *huart);
HAL_StatusTypeDef HAL_UARTEx_DisableFifoMode(UART_HandleTypeDef *huart);
HAL_StatusTypeDef HAL_UARTEx_SetTxFifoThreshold(UART_HandleTypeDef *huart, uint32_t Threshold);
HAL_StatusTypeDef HAL_UARTEx_SetRxFifoThreshold(UART_HandleTypeDef *huart, uint32_t Threshold);

HAL_StatusTypeDef HAL_UARTEx_ReceiveToIdle(UART_HandleTypeDef *huart, uint8_t *pData, uint16_t Size, uint16_t *RxLen,
                                           uint32_t Timeout);
HAL_StatusTypeDef HAL_UARTEx_ReceiveToIdle_IT(UART_HandleTypeDef *huart, uint8_t *pData, uint16_t Size);
#if defined(HAL_DMA_MODULE_ENABLED)
HAL_StatusTypeDef HAL_UARTEx_ReceiveToIdle_DMA(UART_HandleTypeDef *huart, uint8_t *pData, uint16_t Size);
#endif /* HAL_DMA_MODULE_ENABLED */

HAL_UART_RxEventTypeTypeDef HAL_UARTEx_GetRxEventType(const UART_HandleTypeDef *huart);

/* Autonomous Mode Control functions  **********************************************/
HAL_StatusTypeDef HAL_UARTEx_SetConfigAutonomousMode(UART_HandleTypeDef *huart,
                                                     const UART_AutonomousModeConfTypeDef *sConfig);
HAL_StatusTypeDef HAL_UARTEx_GetConfigAutonomousMode(const UART_HandleTypeDef *huart,
                                                     UART_AutonomousModeConfTypeDef *sConfig);
HAL_StatusTypeDef HAL_UARTEx_ClearConfigAutonomousMode(UART_HandleTypeDef *huart);


/**
  * @}
  */

/**
  * @}
  */

