zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_uart_ex.h
/* Private macros ------------------------------------------------------------*/
/** @defgroup UARTEx_Private_Macros UARTEx Private Macros
  * @{
  */

/** @brief  Report the UART clock.
  * @param  __HANDLE__ specifies the UART Handle.
  * @param  __CLOCKSOURCE__ output variable.
  * @retval UART clock, written in __CLOCKSOURCE__.
  */

#if defined (CORE_CA35) || defined (CORE_CM33)
#if defined(UART8) &&  defined(UART9)
#define UART_GETCLOCKSOURCE(__HANDLE__,__CLOCKSOURCE__)   \
  do {                                                    \
    if((__HANDLE__)->Instance == USART1)                  \
    {                                                     \
      (__CLOCKSOURCE__) = RCC_PERIPHCLK_USART1;           \
    }                                                     \
    else if(((__HANDLE__)->Instance == USART2) ||         \
            ((__HANDLE__)->Instance == UART4))            \
    {                                                     \
      (__CLOCKSOURCE__) = RCC_PERIPHCLK_UART2_4;          \
    }                                                     \
    else if(((__HANDLE__)->Instance == USART3) ||         \
            ((__HANDLE__)->Instance == UART5))            \
    {                                                     \
      (__CLOCKSOURCE__) = RCC_PERIPHCLK_UART3_5;          \
    }                                                     \
    else if((__HANDLE__)->Instance == USART6)             \
    {                                                     \
      (__CLOCKSOURCE__) = RCC_PERIPHCLK_USART6;           \
    }                                                     \
    else if(((__HANDLE__)->Instance == UART7) ||          \
            ((__HANDLE__)->Instance == UART8))            \
    {                                                     \
      (__CLOCKSOURCE__) = RCC_PERIPHCLK_UART7_8;          \
    }                                                     \
    else if((__HANDLE__)->Instance == UART9)              \
    {                                                     \
      (__CLOCKSOURCE__) = RCC_PERIPHCLK_UART9;            \
    }                                                     \
    else if((__HANDLE__)->Instance == LPUART1)            \
    {                                                     \
      (__CLOCKSOURCE__) = RCC_PERIPHCLK_LPUART1;          \
    }                                                     \
    else                                                  \
    {                                                     \
      (__CLOCKSOURCE__) = 0;                              \
    }                                                     \
  } while(0U)
#else
#define UART_GETCLOCKSOURCE(__HANDLE__,__CLOCKSOURCE__)   \
  do {                                                    \
    if((__HANDLE__)->Instance == USART1)                  \
    {                                                     \
      (__CLOCKSOURCE__) = RCC_PERIPHCLK_USART1;           \
    }                                                     \
    else if(((__HANDLE__)->Instance == USART2) ||         \
            ((__HANDLE__)->Instance == UART4))            \
    {                                                     \
      (__CLOCKSOURCE__) = RCC_PERIPHCLK_UART2_4;          \
    }                                                     \
    else if(((__HANDLE__)->Instance == USART3) ||         \
            ((__HANDLE__)->Instance == UART5))            \
    {                                                     \
      (__CLOCKSOURCE__) = RCC_PERIPHCLK_UART3_5;          \
    }                                                     \
    else if((__HANDLE__)->Instance == USART6)             \
    {                                                     \
      (__CLOCKSOURCE__) = RCC_PERIPHCLK_USART6;           \
    }                                                     \
    else if((__HANDLE__)->Instance == UART7)              \
    {                                                     \
      (__CLOCKSOURCE__) = RCC_PERIPHCLK_UART7;            \
    }                                                     \
    else if((__HANDLE__)->Instance == LPUART1)            \
    {                                                     \
      (__CLOCKSOURCE__) = RCC_PERIPHCLK_LPUART1;          \
    }                                                     \
    else                                                  \
    {                                                     \
      (__CLOCKSOURCE__) = 0;                              \
    }                                                     \
  } while(0U)
#endif /* defined(UART8) &&  defined(UART9) */
#elif defined (CORE_CM0PLUS)
#define UART_GETCLOCKSOURCE(__HANDLE__,__CLOCKSOURCE__)   \
  do {                                                    \
    (__CLOCKSOURCE__) = 0;                                \
  } while(0U)
#endif /* COREs */


/** @brief  Report the UART mask to apply to retrieve the received data
  *         according to the word length and to the parity bits activation.
  * @note   If PCE = 1, the parity bit is not included in the data extracted
  *         by the reception API().
  *         This masking operation is not carried out in the case of
  *         DMA transfers.
  * @param  __HANDLE__ specifies the UART Handle.
  * @retval None, the mask to apply to UART RDR register is stored in (__HANDLE__)->Mask field.
  */
#define UART_MASK_COMPUTATION(__HANDLE__)                             \
  do {                                                                \
    if ((__HANDLE__)->Init.WordLength == UART_WORDLENGTH_9B)          \
    {                                                                 \
      if ((__HANDLE__)->Init.Parity == UART_PARITY_NONE)              \
      {                                                               \
        (__HANDLE__)->Mask = 0x01FFU ;                                \
      }                                                               \
      else                                                            \
      {                                                               \
        (__HANDLE__)->Mask = 0x00FFU ;                                \
      }                                                               \
    }                                                                 \
    else if ((__HANDLE__)->Init.WordLength == UART_WORDLENGTH_8B)     \
    {                                                                 \
      if ((__HANDLE__)->Init.Parity == UART_PARITY_NONE)              \
      {                                                               \
        (__HANDLE__)->Mask = 0x00FFU ;                                \
      }                                                               \
      else                                                            \
      {                                                               \
        (__HANDLE__)->Mask = 0x007FU ;                                \
      }                                                               \
    }                                                                 \
    else if ((__HANDLE__)->Init.WordLength == UART_WORDLENGTH_7B)     \
    {                                                                 \
      if ((__HANDLE__)->Init.Parity == UART_PARITY_NONE)              \
      {                                                               \
        (__HANDLE__)->Mask = 0x007FU ;                                \
      }                                                               \
      else                                                            \
      {                                                               \
        (__HANDLE__)->Mask = 0x003FU ;                                \
      }                                                               \
    }                                                                 \
    else                                                              \
    {                                                                 \
      (__HANDLE__)->Mask = 0x0000U;                                   \
    }                                                                 \
  } while(0U)

/**
  * @brief Ensure that UART frame length is valid.
  * @param __LENGTH__ UART frame length.
  * @retval SET (__LENGTH__ is valid) or RESET (__LENGTH__ is invalid)
  */
#define IS_UART_WORD_LENGTH(__LENGTH__) (((__LENGTH__) == UART_WORDLENGTH_7B) || \
                                         ((__LENGTH__) == UART_WORDLENGTH_8B) || \
                                         ((__LENGTH__) == UART_WORDLENGTH_9B))

/**
  * @brief Ensure that UART wake-up address length is valid.
  * @param __ADDRESS__ UART wake-up address length.
  * @retval SET (__ADDRESS__ is valid) or RESET (__ADDRESS__ is invalid)
  */
#define IS_UART_ADDRESSLENGTH_DETECT(__ADDRESS__) (((__ADDRESS__) == UART_ADDRESS_DETECT_4B) || \
                                                   ((__ADDRESS__) == UART_ADDRESS_DETECT_7B))

/**
  * @brief Ensure that UART TXFIFO threshold level is valid.
  * @param __THRESHOLD__ UART TXFIFO threshold level.
  * @retval SET (__THRESHOLD__ is valid) or RESET (__THRESHOLD__ is invalid)
  */
#define IS_UART_TXFIFO_THRESHOLD(__THRESHOLD__) (((__THRESHOLD__) == UART_TXFIFO_THRESHOLD_1_8) || \
                                                 ((__THRESHOLD__) == UART_TXFIFO_THRESHOLD_1_4) || \
                                                 ((__THRESHOLD__) == UART_TXFIFO_THRESHOLD_1_2) || \
                                                 ((__THRESHOLD__) == UART_TXFIFO_THRESHOLD_3_4) || \
                                                 ((__THRESHOLD__) == UART_TXFIFO_THRESHOLD_7_8) || \
                                                 ((__THRESHOLD__) == UART_TXFIFO_THRESHOLD_8_8))

/**
  * @brief Ensure that UART RXFIFO threshold level is valid.
  * @param __THRESHOLD__ UART RXFIFO threshold level.
  * @retval SET (__THRESHOLD__ is valid) or RESET (__THRESHOLD__ is invalid)
  */
#define IS_UART_RXFIFO_THRESHOLD(__THRESHOLD__) (((__THRESHOLD__) == UART_RXFIFO_THRESHOLD_1_8) || \
                                                 ((__THRESHOLD__) == UART_RXFIFO_THRESHOLD_1_4) || \
                                                 ((__THRESHOLD__) == UART_RXFIFO_THRESHOLD_1_2) || \
                                                 ((__THRESHOLD__) == UART_RXFIFO_THRESHOLD_3_4) || \
                                                 ((__THRESHOLD__) == UART_RXFIFO_THRESHOLD_7_8) || \
                                                 ((__THRESHOLD__) == UART_RXFIFO_THRESHOLD_8_8))

/**
  * @brief Ensure that UART Trigger polarity state is valid.
  * @param __POLARITY__ UART Trigger polarity.
  * @retval SET (__POLARITY__ is valid) or RESET (__POLARITY__ is invalid)
  */
#define IS_UART_TRIGGER_POLARITY(__POLARITY__)  (((__POLARITY__) == UART_TRIG_POLARITY_RISING) ||\
                                                 ((__POLARITY__) == UART_TRIG_POLARITY_FALLING))

/**
  * @brief Ensure that UART IDLE Frame Transmit state is valid.
  * @param __IDLE__ UART IDLE Frame Transmit state.
  * @retval SET (__IDLE__ is valid) or RESET (__IDLE__ is invalid)
  */
#define IS_UART_IDLE_FRAME_TRANSMIT(__IDLE__)  (((__IDLE__) == UART_IDLE_FRAME_ENABLE) ||\
                                                ((__IDLE__) == UART_IDLE_FRAME_DISABLE))

/**
  * @brief Ensure that UART Trigger source selection is valid.
  * @param __SOURCE__ UART Trigger source selection.
  * @retval SET (__SOURCE__ is valid) or RESET (__SOURCE__ is invalid)
  */
#if defined(STM32MP21xxxx)
#define IS_UART_TRIGGER_SELECTION(__SOURCE__)    ( ((__SOURCE__) >= 4U) &&\
                                                    ((__SOURCE__) <= 15U) && ((__SOURCE__) != 6U) )
#else
/* No trigger for uart on MP25 and MP23 */
#define IS_UART_TRIGGER_SELECTION(__SOURCE__)    ((__SOURCE__) <  0U)
#endif /* STM32MP21xxxx */

/**
  * @brief Ensure that LPUART Trigger source selection is valid.
  * @param __SOURCE__ LPUART Trigger source selection.
  * @retval SET (__SOURCE__ is valid) or RESET (__SOURCE__ is invalid)
  */
/* no trigger 6 */
#define IS_LPUART_TRIGGER_SELECTION(__SOURCE__)  ( ((__SOURCE__) <= 11U) && ((__SOURCE__) != 6U) )

/**
  * @brief Ensure that the number of transferred data is valid.
  * @param __SOURCE__ UART TX data size.
  * @retval SET (__SOURCE__ is valid) or RESET (__SOURCE__ is invalid)
  */
#define IS_UART_TX_DATA_SIZE(__SOURCE__)  ((__SOURCE__) <= 0xFFFFU)

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP2xx_HAL_UART_EX_H */

